import java.util.ArrayList;
import java.util.Arrays;

import solutions.Task001;
import solutions.Task002;
import solutions.Task003;

public class App {
    public static void main(String[] args) throws Exception {
        
        // // Задание 1 Реализовать алгоритм сортировки слиянием(метод взять из Интернета)
        // System.out.println(Arrays.toString(Task001.mergeSort(Task001.randomList())));

        // // Задание 2 Пусть дан произвольный список целых чисел, удалить из него четные числа
        // Task002.arreyCliner();

        // Задание 3. Задан целочисленный список ArrayList. 
        // Найти минимальное, максимальное и среднее из этого списка.
        Task003.numFinder();
        



    }
}
